<?php
if (!defined("qaz_wsxedc_qazxc0FD_123K")){
		die("<a href='index.php'>Login</a> to Web Contents Manager !");
}
function name_ascii($str) {
	$chars = array(
		'a'	=>	array('A','ấ','ầ','ẩ','ẫ','ậ','Ấ','Ầ','Ẩ','Ẫ','Ậ','ắ','ằ','ẳ','ẵ','ặ','Ắ','Ằ','Ẳ','Ẵ','Ặ','á','à','ả','ã','ạ','â','ă','Á','À','Ả','Ã','Ạ','Â','Ă'),
		'e' =>	array('E','ế','ề','ể','ễ','ệ','Ế','Ề','Ể','Ễ','Ệ','é','è','ẻ','ẽ','ẹ','ê','É','È','Ẻ','Ẽ','Ẹ','Ê'),
		'i'	=>	array('I','í','ì','ỉ','ĩ','ị','Í','Ì','Ỉ','Ĩ','Ị'),
		'o'	=>	array('O','ố','ồ','ổ','ỗ','ộ','Ố','Ồ','Ổ','Ô','Ộ','ớ','ờ','ở','ỡ','ợ','Ớ','Ờ','Ở','Ỡ','Ợ','ó','ò','ỏ','õ','ọ','ô','ơ','Ó','Ò','Ỏ','Õ','Ọ','Ô','Ơ'),
		'u'	=>	array('U','ứ','ừ','ử','ữ','ự','Ứ','Ừ','Ử','Ữ','Ự','ú','ù','ủ','ũ','ụ','ư','Ú','Ù','Ủ','Ũ','Ụ','Ư'),
		'y'	=>	array('Y','ý','ỳ','ỷ','ỹ','ỵ','Ý','Ỳ','Ỷ','Ỹ','Ỵ'),
		'd'	=>	array('D','đ','Đ'),
		'q'	=>	array('Q'),
		'w'	=>	array('W'),
		'r'	=>	array('R'),
		't'	=>	array('T'),
		'p'	=>	array('P'),
		's'	=>	array('S'),
		'f'	=>	array('F'),
		'g'	=>	array('G'),
		'h'	=>	array('H'),
		'j'	=>	array('J'),
		'k'	=>	array('K'),
		'l'	=>	array('L'),
		'z'	=>	array('Z'),
		'x'	=>	array('X'),
		'c'	=>	array('C'),
		'v'	=>	array('V'),
		'b'	=>	array('B'),
		'n'	=>	array('N'),
		'm'	=>	array('M'),
		''	=>	array('_'),
		'__'	=>	array('_'),
		"'"	=>	array('_'),
        '?' => array('_'),
	);
	foreach ($chars as $key => $arr)
		foreach ($arr as $val)
			$str = str_replace($val, $key, $str);
	return $str;
}
?>